{
  "zones": {
    "cinthria": {
      "description": "Welcome to the town of Cinthria!",
      "subzones": {
        "prison-vault": {
          "short_description": "An unwelcoming place",
          "long_description": "This is a place to store prisoners in the city of Cinthria. You have no idea why you're here. Maybe there's a way to get out...",
          "objects": {
            "door": {
              "initial_state": {
                "state": "This is a large, old wooden door with an inconspicuous keyhole. It’s currently locked and leads to The Ravenous Raven tavern. The door is sturdy, showing no signs of damage."
              }
            },
            "doormat": {
              "initial_state": {
                "state": "A flammable doormat sits next to the door. It’s intact and hasn’t been burned or broken."
              }
            },
            "torch": {
              "initial_state": {
                "state": "A torch burns brightly, mounted on the wall. It’s full of fuel and hasn’t been claimed by anyone yet."
              }
            },
            "key_001": {
              "initial_state": {
                "state": "This is a key hidden under the doormat. It hasn’t been picked up or claimed by anyone."
              }
            },
            "cracked-stone-wall": {
              "initial_state": {
                "state": "A cracked stone wall stands at the back of the cell, weakened by time and neglect. It’s still holding strong and hides a stash of old bones within."
              }
            },
            "stash-of-old-bones": {
              "initial_state": {
                "state": "A pile of dusty, brittle bones lies hidden behind the cracked stone wall, remnants of a forgotten prisoner. Something valuable might be buried within."
              }
            },
            "hidden-gold": {
              "initial_state": {
                "state": "A small pile of 40 tarnished but valuable gold coins is concealed beneath the stash of old bones. It remains unclaimed and untouched."
              }
            },
            "rusty-shackles": {
              "initial_state": {
                "state": "Rusty shackles are bolted to the wall, a grim reminder of past captives."
              }
            }
          }
        },
        "the-ravenous-raven": {
          "short_description": "The most popular only tavern in town",
          "long_description": "Finally sober, huh? Well, let's fix that! The Ravenous Raven is a lively tavern filled with the clatter of mugs, the smell of ale, and the occasional drunken brawl.",
          "objects": {
            "prison-door": {
              "initial_state": {
                "state": "This door, which you don’t feel like opening, is locked and leads back to the grim prison-vault."
              }
            },
            "barrel-of-ale": {
              "initial_state": {
                "state": "A sturdy wooden barrel behind the bar is brimming with 50 liters of frothy ale. It’s in perfect condition, ready to be tapped."
              }
            },
            "wooden-mug_001": {
              "initial_state": {
                "state": "An empty wooden mug, slightly sticky from past use, sits scattered on a table. It’s unclaimed and undamaged."
              }
            },
            "wooden-mug_002": {
              "initial_state": {
                "state": "Another empty wooden mug, slightly sticky from past use, rests scattered on a table. It’s unclaimed and in good shape."
              }
            },
            "tavern-table": {
              "initial_state": {
                "state": "A heavy oak table, scarred from years of use, stands sturdy in the center of the room. It’s still intact."
              }
            },
            "flickering-lantern": {
              "initial_state": {
                "state": "A rusty lantern hangs from the ceiling, casting a warm, flickering glow. It’s half full of oil and belongs to no one yet."
              }
            },
            "drunken-patron": {
              "initial_state": {
                "state": "A patron is slumped in a corner, too drunk to talk. He’s fixated on ale and beer, mumbling about nothing else."
              }
            },
            "taverner": {
              "initial_state": {
                "state": "The taverner stands behind the bar counter, ready to chat. He greets you with, 'Hello! Finally sober, huh?' and seems open to casual conversation."
              }
            },
            "notice-board": {
              "initial_state": {
                "state": "A weathered wooden board near the entrance holds a single parchment pinned to it."
              }
            },
            "hidden-trapdoor": {
              "initial_state": {
                "state": "A concealed trapdoor lies under the tavern-table, locked and barely noticeable beneath the grime. It leads somewhere within The Ravenous Raven."
              }
            }
          }
        },
        "town-hall": {
          "short_description": "For all official matters"
        },
        "temple-in-cinthria": {
          "short_description": "A sacred temple with ancient carvings on the walls."
        },
        "market-square": {
          "short_description": "(not-implemented) A bustling market filled with merchants."
        }
      }
    }
  },
  "defaultZone": "cinthria",
  "defaultSubzone": "prison-vault"
}